[
    {
        "id": 1,
        "name": "Victor Ferrini",
        "title": "Medical Director",
        "qualifications": [
            "md",
            "facs"
        ],
        "bio": " After graduating from Ohio State University’s undergraduate premedical program, my road to medicine began in 1992 when I entered the Ohio State University College of Medicine. Immediately interested in doing procedural based care, I begin my general surgical residency in 1996 at the Summa Health/Akron City Hospital. Finishing in 2001 and becoming board-certified in surgery, I then began my general surgical career which included not only general surgery but also trauma surgery and critical care in the cities of Lima, Ohio and then Mansfield, Ohio.</p>  In 2013, I decided that trauma surgery was not amendable to my goals for a family and therefore relocated to New Albany, Ohio to practice general surgery only at Licking County Memorial Hospital where I currently practice today. When I am not in the operating room, I enjoy spending time with my wife Tiffany and son Andrew. I especially enjoy international travel but also equally enjoy life’s simple activities such as watching movies on big screen TV or even playing video games with my teenager.</p>  So why would a general surgeon do cosmetics? Patients are my #1 priority. I take a great deal of pride in the care of my patients whether it be a complicated surgical issue or a simple cosmetic procedure. I have always had an interest in doing minor cosmetic procedures that patients desire to improve their overall appearance.</p>  Over the years I have become more involved in doing predominantly injectables such as Botox for that purpose. However, the spectrum of cosmetic procedures has exploded in the last few years with all the improved equipment technology available for us. As a result of my interest in pursuing these, I have accepted the position as medical director for Beyond Esthetics and look forward to taking cosmetic enhancement to the next level.</p>",
        "created_at": "2022-03-08T19:30:20.000000Z",
        "updated_at": "2022-03-08T20:29:44.000000Z"
    },
    {
        "id": 2,
        "name": "Ginger Beard",
        "title": "Medical Assistant",
        "qualifications": [
            "ma"
        ],
        "bio": "  Ginger Beard was born and raised in Texas. She graduated as valedictorian from Southern Careers Institute as a Certified Medical Assistant in November 2017.</h2> She worked in pediatrics for 2 years in Texas gaining a lot of experience. In November 2019 Ginger moved to Ohio when her husband started a new job.</p>  She was introduced to Esthetics and automatically enjoyed it! She found Beyond Esthetics and is so excited to continue learning everyday.</p>  She is excited to further her knowledge in anyway possible and looks forward to meeting lots of new people and making new memories.</p>",
        "created_at": "2022-03-08T19:30:20.000000Z",
        "updated_at": "2022-03-08T19:55:50.000000Z"
    },
    {
        "id": 3,
        "name": "Kerry Hart Stifler",
        "title": "Certified Nurse Practitioner-Certified Laser Technician-Certified Nurse Injector",
        "qualifications": [
            "cnp"
        ],
        "bio": null,
        "created_at": "2022-03-08T19:30:20.000000Z",
        "updated_at": "2022-03-08T19:56:12.000000Z"
    },
    {
        "id": 4,
        "name": "Kelly Hriesik",
        "title": "Certified Nurse Practitioner-Certified Laser Technician-Certified Nurse Injector",
        "qualifications": [
            "cnp"
        ],
        "bio": "  Kelly has been in the medical field since 1996, when she started working for a retail pharmacy. In 1998, she obtained an Associate’s degree in Pharmacy, and in 1999 started Nursing school.</p>  Kelly graduated in 2002 with an Associate’s degree in Nursing, and went on to get her BSN in 2015. In 2018, she graduated with my Master’s Degree in Nursing.</p>  Kelly has been married to her husband for 18 years, and they have 3 children. She enjoy anything outdoors and spending as much time with her family and friends as possible. They are blessed to have a very tight-knit group of friends whom they consider family, and spend most of their free time either camping or just hanging out with them.</p>  “I am so excited to become part of the Beyond Esthetic family”</p>",
        "created_at": "2022-03-08T19:30:20.000000Z",
        "updated_at": "2022-03-08T20:27:06.000000Z"
    },
    {
        "id": 5,
        "name": "Sherry Johnson",
        "title": "Patient Coordinator",
        "qualifications": [],
        "bio": null,
        "created_at": "2022-03-08T19:30:20.000000Z",
        "updated_at": "2022-03-08T20:30:24.000000Z"
    },
    {
        "id": 6,
        "name": "Alex Reed",
        "title": "Patient Coordinator",
        "qualifications": [],
        "bio": "  Alex is always ready to greet you with a smile,  answer any questions you may have, and set up your appointments.  You might recognize her voice, as you may of scheduled over the phone with her.</p>  Alex is attending the Ashland University College of Nursing and has her STNA. Once she completes her Bachelors degree she plans to further her education and become a Nurse Practitioner.   </p>  Alex sees Beyond Esthetics as a great learning opportunity.  She has learned what each service has to offer,  continues to keep abreast with new technology and services, and applies this with furthering her education at AU. </p>",
        "created_at": "2022-03-08T19:30:20.000000Z",
        "updated_at": "2022-03-08T20:31:36.000000Z"
    },
    {
        "id": 7,
        "name": "Faith Holbrook",
        "title": "Licensed Cosmetologist ",
        "qualifications": [],
        "bio": "  Faith is a graduate of Ontario high school and has been in the field as a licensed hair dresser since 2006 and started specializing in facials and lashes these last couple years. Which she has realized this to be her dream job.</p>  She has a been happily married for 11 years to Chris. They have 3 kiddos and an amazing daughter-in-law!!!</p>  Faith has gone to Diamond Hill cathedral since she was born and she enjoys spending her free time with family and friends. She is also an avid Browns and Buckeyes fan!</p>",
        "created_at": "2022-03-08T19:30:20.000000Z",
        "updated_at": "2022-03-08T20:33:46.000000Z"
    },
    {
        "id": 8,
        "name": "Darcy Reed",
        "title": "Medical Assistant-Clinical Assistant",
        "qualifications": [
            "ma"
        ],
        "bio": "  Darcy Reed is a Medical Assistant at Beyond Esthetics.  She initially received a degree in Radiology and then acquired additional training in Nuclear Medicine, (CT) Computerized Technology, Bone Density, Mammography and Quality Assurance.  Her 30 year career includes time at local hospitals, women’s health facilities, and working as a Health Physicist for the Ohio Department of Health enforcing compliance with state regulations.  </p>  Darcy has a strong passion for the healthcare industry and the clients well-being. She believes a few kind words and thoughtful listening can be as beneficial to ones well being as the procedure itself.  Her goal is that each patient will leave feeling better than they did when they came in.  </p>  Darcy offers several procedures which help to improve the overall body image.  One of her specialties is Cryo T-Shock which can reduce fat, contour specific body parts, promote skin rejuvenation and assist with therapeutic rehabilitation.  </p>  Darcy is also continually researching and learning about the latest technologies related to the Esthetics industry.  New procedures and advances in equipment keep this a fast paced and exciting way to promote better health for women and men alike.</p>  When she’s not working, Darcy enjoys spending time with her family.  She is married to Steven Reed, has a son, Michael, and twin daughters, Alexandra and Alaina.  Ask her about her greatest accomplishments and she will tell you it’s her family and serving others.</p>   </p>   </p>   </p>",
        "created_at": "2022-03-08T19:30:20.000000Z",
        "updated_at": "2022-03-08T19:56:56.000000Z"
    },
    {
        "id": 9,
        "name": "Annette Mangan",
        "title": "Registered Nurse-Clinical Assistant",
        "qualifications": [
            "rn",
            "bsn"
        ],
        "bio": "  Annette Mangan is one of the nurses at Beyond Esthetics. She graduated from Med Central School of Nursing with her RN and from The Ohio State University with her BSN. </p>  She has been married to her husband Robb for the past 21 years. They have four children: JC, Molly, Macy and Robbee. </p>  “I love being a nurse and working with all our clients at Beyond Esthetics”!</p>   </p>",
        "created_at": "2022-03-08T19:30:20.000000Z",
        "updated_at": "2022-03-08T19:57:16.000000Z"
    },
    {
        "id": 10,
        "name": "Melissa Satterfield",
        "title": "Certified Clinical Medical Assistant",
        "qualifications": [
            "ccma"
        ],
        "bio": "  A native of Central Ohio, Melissa is multi certified, medical educator of 11 years in the local area at multiple, joint education facilities. While working as a registered medical assistant, Melissa grew her medical career into a pathology technician, and surgical technologist, and then adding her Billing and Coding Specialist certification.</p>  Melissa found her true calling as a surgical technologist in the field of MOHS surgery, facial occuloplastics, and Dermatology. With career experience in multiple medical fields, Melissa has lent her skilled knowledge and experience to multiple practitioners and clinics throughout Ohio through medical practice consulting, to help build and deliver the best practice and patient care experience. Melissa is a current student at EGCC where she is completing her final year of her bachelors in Medical Management with a legal emphasis, while also taking pre-law courses.</p>  Some may best know her through her legal advocacy initiatives in the ASD community with behavioral and educational supports for local districts and families working and living with autism.</p>",
        "created_at": "2022-03-08T19:30:20.000000Z",
        "updated_at": "2022-03-08T23:43:32.000000Z"
    },
    {
        "id": 11,
        "name": "Libby Jarvis",
        "title": "Licensed Cosmetologist ",
        "qualifications": [],
        "bio": "  Libby, started her career in her early years of high school cutting her family and friends hair, basically anyone she could convince to sit and allow her. At her Grandmothers suggestion, she attend Cosmetology school.</p>  Right after high school, Libby got married and and had 3 children but never forgot her desire to have a career in Cosmetology. When her youngest was in school full time, Libby applied to Wooster Beauty College.</p>  Libby’s career started in the mid 1980’s, and her passion quickly grew. Realizing she wanted to expand her knowledge in all facets of the business, Libby applied to Barbara Salamone’s school of Esthetics, in Chicago, Illinois.</p>  After working at a salon for 10 years, Libby, and her friend, opened their own salon. During that time, Libby, realizing she wanted to give back to the profession she so loves, became an Instructor at Wooster Beauty College. For many years she worked full time at both locations. After the College closed it doors, Libby began working part time for a Dermatologist, expanding her knowledge in all things pertaining to skincare. The Doctor held many training seminars and education sessions which Libby enjoyed to further her education.</p>  Wanting to stop traveling, Libby started working for her cousin at Beyond Esthetics. It was there that Libby continued expanding her education in the many fazes of our skin care needs. Although, Libby has been in this industry for over 30+ years, she doesn’t have any plans of stopping anytime soon. “My clients are like family, many of whom have been with me from the beginning. I feel as though I’ve gone though life with them. God has absolutely giving me not only an amazing career, but the most fabulous clients to go through this journey with. I will forever be appreciative of each and everyone.”</p>",
        "created_at": "2022-03-08T19:30:20.000000Z",
        "updated_at": "2022-03-08T20:35:39.000000Z"
    },
    {
        "id": 12,
        "name": "Sandy Martin",
        "title": "Marketing Director",
        "qualifications": null,
        "bio": null,
        "created_at": "2022-03-08T19:30:20.000000Z",
        "updated_at": "2022-03-08T19:30:20.000000Z"
    },
    {
        "id": 13,
        "name": "Nicci See",
        "title": "Licensed Esthetician-Skincare Specialist",
        "qualifications": [
            "le"
        ],
        "bio": "  Nicci grew up in the Ashland area graduating from Crestview High School. She then attended OSU, before working in the non-profit sector in Washington, DC. She worked and managed various restaurants in the Columbus and Mansfield areas before deciding to return to school to pursue her passion – all things skin and beauty.She is a Licensed Advanced Esthetican and makeup artist that specializes in customized facials, dermaplaning, chemical peels, full body waxing, body scrubs, relaxation massage, lash lifts, lash extensions, and brow/lash tints. She is currently mastering threading and will also be offering that service in the near future.</p>  Aside from her passion for esthetics, she loves her sisters, her animals, music and pop culture – with a special affinity for all things Star Wars. May the Force be with you.</p>",
        "created_at": "2022-03-08T19:30:20.000000Z",
        "updated_at": "2022-03-08T20:37:12.000000Z"
    },
    {
        "id": 14,
        "name": "Brynn Hall",
        "title": "Certified Laser Technician-Certified Nurse Injector",
        "qualifications": [
            "rn"
        ],
        "bio": "  Hello all, my name is Brynn Hall and I am so excited to be joining Beyond Esthetics.</p>  My family and I live in Ontario, where I was born and raised. I am married with 2 beautiful girls, ages 10 and 6. We love being with our family and friends, hanging outside, traveling and anything sports related. </p>  I have been in healthcare the past 15 years predominantly in the acute care setting. The last two years I have been a nurse practitioner in primary care. Patient advocacy is my driving force and I will always do everything I can to give my patients a voice.</p>  Esthetics became a passion of mine after having my two daughters. I struggled with my skin due to hormonal changes and I did all I could to clear it up.  I want to help other women and men address their concerns and give them the confidence. Our skin is the first and last thing people see. I want to help others bring out their own beauty.</p>",
        "created_at": "2022-03-08T19:30:20.000000Z",
        "updated_at": "2022-03-08T20:38:24.000000Z"
    },
    {
        "id": 15,
        "name": "Diane Seamour",
        "title": "Registered Nurse-Medical Assistant-Clinical Assistant",
        "qualifications": [
            "rn"
        ],
        "bio": "  Diane graduated with her BSN from the University of Colorado Health and Sciences. Prior to her 18 years as a Surgical RN, Diane worked in cosmetics for 8 years.</p>  She, her husband and two fur babies recently moved to Ashland from Colorado. Diane is excited to meet new people and use her nursing skills and experience in the world of esthetics.</p>  Diane has a passion for fitness, baking, and spending time with her family. In her time off you can find her creating custom sugar cookies.</p>",
        "created_at": "2022-03-08T19:30:20.000000Z",
        "updated_at": "2022-03-08T20:39:27.000000Z"
    },
    {
        "id": 16,
        "name": "Angel Standridge",
        "title": "Certified Nurse Practitioner-Certified Laser Technician-Certified Nurse Injector",
        "qualifications": [
            "cnp"
        ],
        "bio": "  Evangeline 'Angel' Standridge is a board certified Nurse Practitioner. Angel grew up in Dallas, Texas and later moved to Pensacola, Florida where she met her husband while both obtaining their nursing degrees, before eventually moving to Ohio to be close to family.</p>  She has a number of years of nursing and healthcare experience, working in hospitals all over the country and in a variety of critical care settings.</p>  Angel is passionate about caring for her patients and building a strong relationship with her clients. She loves to help patients meet their goals! She is excited to join our team to provide wellness and aesthetic services to our clients.</p>  In her free time, Angel loves spending time with her husband, family, cooking, and traveling! </p>",
        "created_at": "2022-03-08T19:30:20.000000Z",
        "updated_at": "2022-03-08T20:42:41.000000Z"
    },
    {
        "id": 17,
        "name": "Amy O'Brien",
        "title": "Patient Coordinator",
        "qualifications": null,
        "bio": null,
        "created_at": "2022-03-08T19:30:20.000000Z",
        "updated_at": "2022-03-08T19:30:20.000000Z"
    },
    {
        "id": 18,
        "name": "Matt Reed",
        "title": "Office Manager",
        "qualifications": [],
        "bio": null,
        "created_at": "2022-03-08T19:30:20.000000Z",
        "updated_at": "2022-03-08T20:43:38.000000Z"
    },
    {
        "id": 19,
        "name": "Maria Gallo",
        "title": "Patient Coordinator",
        "qualifications": [],
        "bio": null,
        "created_at": "2022-03-08T19:30:20.000000Z",
        "updated_at": "2022-03-08T20:45:00.000000Z"
    },
    {
        "id": 20,
        "name": "Tonya Goulding",
        "title": "Owner",
        "qualifications": [
            "le"
        ],
        "bio": "  Tonya Goulding graduated from Mount Vernon Nazarene University in 2001 with her Bachelor of Business degree. Tonya received her Esthetics license in 2009 from the Spa School, and completed her permanent makeup certification in 2012.  After practicing permanent makeup for several years, she went on to receive her master certification and instructor license in Permanent Makeup.  </p>  After practicing esthetics, Tonya began working for Skin for Life as an educator and salesperson, while maintaining her personal clientele.  She worked out of several establishments simultaneously: Corner Creation, Creative Concepts, and Studio 19. While alternating locations, she would carry her equipment in and out of each location daily. After several years of drive, determination and prayer, she was able realize her dream and opened her own practice in 2013, Beyond Esthetics in Ontario, Ohio.   </p>  Working directly with clients is one of Tonya’s passions, with training other estheticians being another.  She finds great reward in assisting a student to the point of an “ah ha” moment, and helping students reach their own professional and personal goals.. She is a trainer for Dermaplane Pro; and Beyond Esthetics is also partnered with Nouveau Contour and Tina Davies to offer training classes for a permanent makeup and microblading. </p>  Tonya has been married to Steve Goulding for over 18 years.  They have two children, Hunter Reed and Kendal Goulding. The family enjoys going to church, singing, and doing biblical portrayals.    </p>",
        "created_at": "2022-03-08T20:47:22.000000Z",
        "updated_at": "2022-03-08T20:47:22.000000Z"
    }
]